SignServiceTests/Assets/Smev3/GetRequestRequestWithFilter.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns1="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">
   <soapenv:Header/>
   <soapenv:Body>
		      <ns:GetRequestRequest>
		         <ns2:MessageTypeSelector xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1" xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" Id="SIGNED_BY_CALLER"><ns2:NamespaceURI>urn://x-artefacts-gibdd-gov-ru/breach/root/1.0</ns2:NamespaceURI><ns2:RootElementLocalName>BreachRequest</ns2:RootElementLocalName><ns2:Timestamp>2014-02-11T17:10:03.616+04:00</ns2:Timestamp></ns2:MessageTypeSelector>
		         <!--Optional:-->
		         <ns:CallerInformationSystemSignature><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><ds:Reference URI="#SIGNED_BY_CALLER"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:Transform Algorithm="urn://smev-gov-ru/xmldsig/transform"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><ds:DigestValue>xPtdSjogBSJahRJisbZWEyqRG5+WEHR6PPYUAm8yjzs=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>G+Bjpejgc49EfKlK8JeKCNeK9zFl3cKMseTp45h3kGLziuhInkDxFb46uetCz2SsyklO8rmM3hJUX6k22ad9Fw==</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIIBeDCCASWgAwIBAgIEMRFBsjAKBgYqhQMCAgMFADAxMRAwDgYDVQQLEwdTWVNURU0xMRAwDgYDVQQKEwdtdGZvaXYxMQswCQYDVQQGEwJSVTAeFw0xNDA5MDQwOTIxNDVaFw0xNDEyMDMwOTIxNDVaMDExEDAOBgNVBAsTB1NZU1RFTTExEDAOBgNVBAoTB210Zm9pdjExCzAJBgNVBAYTAlJVMGMwHAYGKoUDAgITMBIGByqFAwICIwEGByqFAwICHgEDQwAEQEJ2ZSpw1tSo/cylifftd268aXKoMnQBUyx6Oj/t/jKF9Btue0la3cQjNGkTnwMC2G0towX/atXIskbaWXoX6ZSjITAfMB0GA1UdDgQWBBRy0XtQ9B2w/p/OR0jEH8N7jC5FSDAKBgYqhQMCAgMFAANBANCHlS68Rzs2eYiRfTwk1EnQzCTjNFjG4DdDW5/vK8I2hQ/v4vcmV+CCUjt1IZb2PiAVpl1pIU8oAEe3WGxbAwM=</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></ns:CallerInformationSystemSignature>
		      </ns:GetRequestRequest>
   </soapenv:Body>
</soapenv:Envelope>