UniDsproc/UniDsproc/Tests/smev3.ack.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns1="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">
	<soapenv:Header/>
	<soapenv:Body>
		<ns:AckRequest>
			<ns2:AckTargetMessage xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1" xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" Id="SIGNED_BY_SERVER" accepted="true">0e8cfc01-5e81-11e4-a9ff-d4c9eff07b77</ns2:AckTargetMessage>
			<ns:CallerInformationSystemSignature>
				<!-- SIGNATURE -->
			</ns:CallerInformationSystemSignature>
		</ns:AckRequest>
	</soapenv:Body>
</soapenv:Envelope>