!_Data/ТЗ/TestFiles/SmallFileToSign.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">	<soapenv:Header />	<soapenv:Body>		<ns:GetRequestRequest>			<ns2:MessageTypeSelector xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" Id="ID_SIGN">				<ns2:Timestamp><!--2015-12-01T14:33:09+03:00--></ns2:Timestamp>			</ns2:MessageTypeSelector>			<ns:CallerInformationSystemSignature>				<!-- Sgnature -->			</ns:CallerInformationSystemSignature>		</ns:GetRequestRequest>	</soapenv:Body></soapenv:Envelope>
