SignServiceTests/Assets/Smev3/AckRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns1="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:AckRequest>
         <ns2:AckTargetMessage xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1" xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" Id="SIGNED_BY_CALLER" accepted="true">0e8cfc01-5e81-11e4-a9ff-d4c9eff07b77</ns2:AckTargetMessage>
         <ns:CallerInformationSystemSignature><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><ds:Reference URI="#SIGNED_BY_CALLER"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:Transform Algorithm="urn://smev-gov-ru/xmldsig/transform"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><ds:DigestValue>PXd1LeLr8ng039jaMgcrumvN/MkvDxFKSqH+phrHVrI=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Ob4GWMIuD14t3yjsZooHvrf8uhb/ivC8b/fp7CvXKvSA1C+YCFdwfe49qbybO4U/BuM55D7FbPRzw7ZtEFCnsw==</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIIBeDCCASWgAwIBAgIEMRFBsjAKBgYqhQMCAgMFADAxMRAwDgYDVQQLEwdTWVNURU0xMRAwDgYDVQQKEwdtdGZvaXYxMQswCQYDVQQGEwJSVTAeFw0xNDA5MDQwOTIxNDVaFw0xNDEyMDMwOTIxNDVaMDExEDAOBgNVBAsTB1NZU1RFTTExEDAOBgNVBAoTB210Zm9pdjExCzAJBgNVBAYTAlJVMGMwHAYGKoUDAgITMBIGByqFAwICIwEGByqFAwICHgEDQwAEQEJ2ZSpw1tSo/cylifftd268aXKoMnQBUyx6Oj/t/jKF9Btue0la3cQjNGkTnwMC2G0towX/atXIskbaWXoX6ZSjITAfMB0GA1UdDgQWBBRy0XtQ9B2w/p/OR0jEH8N7jC5FSDAKBgYqhQMCAgMFAANBANCHlS68Rzs2eYiRfTwk1EnQzCTjNFjG4DdDW5/vK8I2hQ/v4vcmV+CCUjt1IZb2PiAVpl1pIU8oAEe3WGxbAwM=</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></ns:CallerInformationSystemSignature>
      </ns:AckRequest>
   </soapenv:Body>
</soapenv:Envelope>